def encode_to_morse(text):
    '''функция для кодировки текста азбукой Морзе'''
    itog = []
    for i in text.lower():
        itog.append(MorseCode[i])
    return ' '.join(itog)


def decode_from_morse(code):
    '''функция для декодировки текста из азбуки Морзе'''
    itog = []
    tmp = code.replace('  ', '*')
    for i in tmp.split():
        if i[-1] == '*':
            itog.append(CharCode.get(i[:-1], '(несуществующая комбинация "{}")'.format(i[:-1])))
            itog.append('*')
        else:
            itog.append(CharCode.get(i, '(несуществующая комбинация "{}")'.format(i)))
    return ''.join(itog).replace('*', ' ')


def reverse_morse(slovar):
    '''функция для "разворота" словаря. Меняем ключи и их значения местами'''
    slovartmp = {}
    for key, val in slovar.items():
        slovartmp[val] = key
    return slovartmp


MorseCode = {'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.', 'g': '--.',
             'h': '....', 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.',
             'o': '---', 'p': '.--.', 'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-',
             'v': '...-', 'w': '.--', 'x': '-..-', 'y': '-.--', 'z': '--..', 'а': '.-', 'б': '-...',
             'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ж': '...-', 'з': '--..', 'и': '..',
             'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '----', 'п': '.--.',
             'р': '.-.', 'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
             'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '.--.-.', 'ы': '-.--', 'ь': '-..-',
             'э': '...-...', 'ю': '..--', 'я': '.-.-', '1': '.----', '2': '..---', '3': '...--',
             '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.',
             '0': '-----', ' ': ' ', '*': '*'}  # словари для кодирования и декодирования текста

CharCode = reverse_morse(MorseCode)  # перевернутый словарь
text = input('''Здравствуйте!\nДанная программа передназначена для кодирования
и декодирования текста из/в азбуки(у) Морзе на английском и русском языках.\n
Введите буквы, цифры или символы. Символы разных букв друг от друга отделяйте одним пробелом, 
а отдельные слова - тройным пробелом. Программа сама поймет, 
в какую сторону осуществить перевод:\n''')

# проверка введенного текста на допустимые символы
proverka = not text.isalnum() and (not text.isalpha() or not text.isdigit())
for i in text:
    if i in '!@#$%^&*()+="№;%:?*':
        a = False
    else:
        a = True
if not a:
    while proverka:
        text = input('Упс... Кажется, в тексте присутствуют некодируемые символы. Повторите ввод:\n')
        proverka = not text.isalnum() and (not text.isalpha() or not text.isdigit())
if text[0].isalnum() or text[0].isalpha() or text[0].isdigit():
    print(encode_to_morse(text) + '\nКодирование выполнено!')
elif text[0] == '.' or '-':
    print(decode_from_morse(text) + '\nДекодирование выполнено!')

    print(decode_from_morse(text) + '\nДекодирование выполнено успешно!')
